hathach/tinyusb/hw/bsp/mcx/sdk/devices/MCXN947/mcuxpresso/startup_mcxn947_cm33_core1.cpp
WEAK void LP_FLEXCOMM7_IRQHandler(void)
{
    LP_FLEXCOMM7_DriverIRQHandler();
}

WEAK void LP_FLEXCOMM8_IRQHandler(void)
{
    LP_FLEXCOMM8_DriverIRQHandler();
}

WEAK void LP_FLEXCOMM9_IRQHandler(void)
{
    LP_FLEXCOMM9_DriverIRQHandler();
}

WEAK void ADC0_IRQHandler(void)
{
    ADC0_DriverIRQHandler();
}

WEAK void ADC1_IRQHandler(void)
{
    ADC1_DriverIRQHandler();
}

WEAK void PINT0_IRQHandler(void)
{
    PINT0_DriverIRQHandler();
}

WEAK void PDM_EVENT_IRQHandler(void)
{
    PDM_EVENT_DriverIRQHandler();
}

WEAK void Reserved65_IRQHandler(void)
{
    Reserved65_DriverIRQHandler();
}

WEAK void USB0_FS_IRQHandler(void)
{
    USB0_FS_DriverIRQHandler();
}

WEAK void USB0_DCD_IRQHandler(void)
{
    USB0_DCD_DriverIRQHandler();
}

WEAK void RTC_IRQHandler(void)
{
    RTC_DriverIRQHandler();
}

WEAK void SMARTDMA_IRQHandler(void)
{
    SMARTDMA_DriverIRQHandler();
}

WEAK void MAILBOX_IRQHandler(void)
{
    MAILBOX_DriverIRQHandler();
}

WEAK void CTIMER3_IRQHandler(void)
{
    CTIMER3_DriverIRQHandler();
}

WEAK void CTIMER4_IRQHandler(void)
{
    CTIMER4_DriverIRQHandler();
}

WEAK void OS_EVENT_IRQHandler(void)
{
    OS_EVENT_DriverIRQHandler();
}

WEAK void FLEXSPI0_IRQHandler(void)
{
    FLEXSPI0_DriverIRQHandler();
}

WEAK void SAI0_IRQHandler(void)
{
    SAI0_DriverIRQHandler();
}

WEAK void SAI1_IRQHandler(void)
{
    SAI1_DriverIRQHandler();
}

WEAK void USDHC0_IRQHandler(void)
{
    USDHC0_DriverIRQHandler();
}

WEAK void CAN0_IRQHandler(void)
{
    CAN0_DriverIRQHandler();
}

WEAK void CAN1_IRQHandler(void)
{
    CAN1_DriverIRQHandler();
}

WEAK void Reserved80_IRQHandler(void)
{
    Reserved80_DriverIRQHandler();
}

WEAK void Reserved81_IRQHandler(void)
{
    Reserved81_DriverIRQHandler();
}

WEAK void USB1_HS_PHY_IRQHandler(void)
{
    USB1_HS_PHY_DriverIRQHandler();
}

WEAK void USB1_HS_IRQHandler(void)
{
    USB1_HS_DriverIRQHandler();
}

WEAK void SEC_HYPERVISOR_CALL_IRQHandler(void)
{
    SEC_HYPERVISOR_CALL_DriverIRQHandler();
}

WEAK void Reserved85_IRQHandler(void)
{
    Reserved85_DriverIRQHandler();
}

WEAK void PLU_IRQHandler(void)
{
    PLU_DriverIRQHandler();
}

WEAK void Freqme_IRQHandler(void)
{
    Freqme_DriverIRQHandler();
}

WEAK void SEC_VIO_IRQHandler(void)
{
    SEC_VIO_DriverIRQHandler();
}

WEAK void ELS_IRQHandler(void)
{
    ELS_DriverIRQHandler();
}

WEAK void PKC_IRQHandler(void)
{
    PKC_DriverIRQHandler();
}

WEAK void PUF_IRQHandler(void)
{
    PUF_DriverIRQHandler();
}

WEAK void PQ_IRQHandler(void)
{
    PQ_DriverIRQHandler();
}

WEAK void EDMA_1_CH0_IRQHandler(void)
{
    EDMA_1_CH0_DriverIRQHandler();
}

WEAK void EDMA_1_CH1_IRQHandler(void)
{
    EDMA_1_CH1_DriverIRQHandler();
}

WEAK void EDMA_1_CH2_IRQHandler(void)
{
    EDMA_1_CH2_DriverIRQHandler();
}

WEAK void EDMA_1_CH3_IRQHandler(void)
{
    EDMA_1_CH3_DriverIRQHandler();
}

WEAK void EDMA_1_CH4_IRQHandler(void)
{
    EDMA_1_CH4_DriverIRQHandler();
}

WEAK void EDMA_1_CH5_IRQHandler(void)
{
    EDMA_1_CH5_DriverIRQHandler();
}

WEAK void EDMA_1_CH6_IRQHandler(void)
{
    EDMA_1_CH6_DriverIRQHandler();
}

WEAK void EDMA_1_CH7_IRQHandler(void)
{
    EDMA_1_CH7_DriverIRQHandler();
}

WEAK void EDMA_1_CH8_IRQHandler(void)
{
    EDMA_1_CH8_DriverIRQHandler();
}

WEAK void EDMA_1_CH9_IRQHandler(void)
{
    EDMA_1_CH9_DriverIRQHandler();
}

WEAK void EDMA_1_CH10_IRQHandler(void)
{
    EDMA_1_CH10_DriverIRQHandler();
}

WEAK void EDMA_1_CH11_IRQHandler(void)
{
    EDMA_1_CH11_DriverIRQHandler();
}

WEAK void EDMA_1_CH12_IRQHandler(void)
{
    EDMA_1_CH12_DriverIRQHandler();
}

WEAK void EDMA_1_CH13_IRQHandler(void)
{
    EDMA_1_CH13_DriverIRQHandler();
}

WEAK void EDMA_1_CH14_IRQHandler(void)
{
    EDMA_1_CH14_DriverIRQHandler();
}

WEAK void EDMA_1_CH15_IRQHandler(void)
{
    EDMA_1_CH15_DriverIRQHandler();
}

WEAK void CDOG0_IRQHandler(void)
{
    CDOG0_DriverIRQHandler();
}

WEAK void CDOG1_IRQHandler(void)
{
    CDOG1_DriverIRQHandler();
}

WEAK void I3C0_IRQHandler(void)
{
    I3C0_DriverIRQHandler();
}

WEAK void I3C1_IRQHandler(void)
{
    I3C1_DriverIRQHandler();
}

WEAK void NPU_IRQHandler(void)
{
    NPU_DriverIRQHandler();
}

WEAK void GDET_IRQHandler(void)
{
    GDET_DriverIRQHandler();
}

WEAK void VBAT0_IRQHandler(void)
{
    VBAT0_DriverIRQHandler();
}

WEAK void EWM0_IRQHandler(void)
{
    EWM0_DriverIRQHandler();
}

WEAK void TSI_END_OF_SCAN_IRQHandler(void)
{
    TSI_END_OF_SCAN_DriverIRQHandler();
}

WEAK void TSI_OUT_OF_SCAN_IRQHandler(void)
{
    TSI_OUT_OF_SCAN_DriverIRQHandler();
}

WEAK void EMVSIM0_IRQHandler(void)
{
    EMVSIM0_DriverIRQHandler();
}

WEAK void EMVSIM1_IRQHandler(void)
{
    EMVSIM1_DriverIRQHandler();
}

WEAK void FLEXIO_IRQHandler(void)
{
    FLEXIO_DriverIRQHandler();
}

WEAK void DAC0_IRQHandler(void)
{
    DAC0_DriverIRQHandler();
}

WEAK void DAC1_IRQHandler(void)
{
    DAC1_DriverIRQHandler();
}

WEAK void DAC2_IRQHandler(void)
{
    DAC2_DriverIRQHandler();
}

WEAK void HSCMP0_IRQHandler(void)
{
    HSCMP0_DriverIRQHandler();
}

WEAK void HSCMP1_IRQHandler(void)
{
    HSCMP1_DriverIRQHandler();
}

WEAK void HSCMP2_IRQHandler(void)
{
    HSCMP2_DriverIRQHandler();
}

WEAK void FLEXPWM0_RELOAD_ERROR_IRQHandler(void)
{
    FLEXPWM0_RELOAD_ERROR_DriverIRQHandler();
}

WEAK void FLEXPWM0_FAULT_IRQHandler(void)
{
    FLEXPWM0_FAULT_DriverIRQHandler();
}

WEAK void FLEXPWM0_SUBMODULE0_IRQHandler(void)
{
    FLEXPWM0_SUBMODULE0_DriverIRQHandler();
}

WEAK void FLEXPWM0_SUBMODULE1_IRQHandler(void)
{
    FLEXPWM0_SUBMODULE1_DriverIRQHandler();
}

WEAK void FLEXPWM0_SUBMODULE2_IRQHandler(void)
{
    FLEXPWM0_SUBMODULE2_DriverIRQHandler();
}

WEAK void FLEXPWM0_SUBMODULE3_IRQHandler(void)
{
    FLEXPWM0_SUBMODULE3_DriverIRQHandler();
}

WEAK void FLEXPWM1_RELOAD_ERROR_IRQHandler(void)
{
    FLEXPWM1_RELOAD_ERROR_DriverIRQHandler();
}

WEAK void FLEXPWM1_FAULT_IRQHandler(void)
{
    FLEXPWM1_FAULT_DriverIRQHandler();
}

WEAK void FLEXPWM1_SUBMODULE0_IRQHandler(void)
{
    FLEXPWM1_SUBMODULE0_DriverIRQHandler();
}

WEAK void FLEXPWM1_SUBMODULE1_IRQHandler(void)
{
    FLEXPWM1_SUBMODULE1_DriverIRQHandler();
}

