hathach/tinyusb/hw/bsp/mcx/sdk/devices/MCXN947/mcuxpresso/startup_mcxn947_cm33_core1.cpp
WEAK void FLEXPWM1_SUBMODULE2_IRQHandler(void)
{
    FLEXPWM1_SUBMODULE2_DriverIRQHandler();
}

WEAK void FLEXPWM1_SUBMODULE3_IRQHandler(void)
{
    FLEXPWM1_SUBMODULE3_DriverIRQHandler();
}

WEAK void ENC0_COMPARE_IRQHandler(void)
{
    ENC0_COMPARE_DriverIRQHandler();
}

WEAK void ENC0_HOME_IRQHandler(void)
{
    ENC0_HOME_DriverIRQHandler();
}

WEAK void ENC0_WDG_SAB_IRQHandler(void)
{
    ENC0_WDG_SAB_DriverIRQHandler();
}

WEAK void ENC0_IDX_IRQHandler(void)
{
    ENC0_IDX_DriverIRQHandler();
}

WEAK void ENC1_COMPARE_IRQHandler(void)
{
    ENC1_COMPARE_DriverIRQHandler();
}

WEAK void ENC1_HOME_IRQHandler(void)
{
    ENC1_HOME_DriverIRQHandler();
}

WEAK void ENC1_WDG_SAB_IRQHandler(void)
{
    ENC1_WDG_SAB_DriverIRQHandler();
}

WEAK void ENC1_IDX_IRQHandler(void)
{
    ENC1_IDX_DriverIRQHandler();
}

WEAK void ITRC0_IRQHandler(void)
{
    ITRC0_DriverIRQHandler();
}

WEAK void BSP32_IRQHandler(void)
{
    BSP32_DriverIRQHandler();
}

WEAK void ELS_ERR_IRQHandler(void)
{
    ELS_ERR_DriverIRQHandler();
}

WEAK void PKC_ERR_IRQHandler(void)
{
    PKC_ERR_DriverIRQHandler();
}

WEAK void ERM_SINGLE_BIT_ERROR_IRQHandler(void)
{
    ERM_SINGLE_BIT_ERROR_DriverIRQHandler();
}

WEAK void ERM_MULTI_BIT_ERROR_IRQHandler(void)
{
    ERM_MULTI_BIT_ERROR_DriverIRQHandler();
}

WEAK void FMU0_IRQHandler(void)
{
    FMU0_DriverIRQHandler();
}

WEAK void ETHERNET_IRQHandler(void)
{
    ETHERNET_DriverIRQHandler();
}

WEAK void ETHERNET_PMT_IRQHandler(void)
{
    ETHERNET_PMT_DriverIRQHandler();
}

WEAK void ETHERNET_MACLP_IRQHandler(void)
{
    ETHERNET_MACLP_DriverIRQHandler();
}

WEAK void SINC_FILTER_IRQHandler(void)
{
    SINC_FILTER_DriverIRQHandler();
}

WEAK void LPTMR0_IRQHandler(void)
{
    LPTMR0_DriverIRQHandler();
}

WEAK void LPTMR1_IRQHandler(void)
{
    LPTMR1_DriverIRQHandler();
}

WEAK void SCG_IRQHandler(void)
{
    SCG_DriverIRQHandler();
}

WEAK void SPC_IRQHandler(void)
{
    SPC_DriverIRQHandler();
}

WEAK void WUU_IRQHandler(void)
{
    WUU_DriverIRQHandler();
}

WEAK void PORT_EFT_IRQHandler(void)
{
    PORT_EFT_DriverIRQHandler();
}

WEAK void ETB0_IRQHandler(void)
{
    ETB0_DriverIRQHandler();
}

WEAK void SM3_IRQHandler(void)
{
    SM3_DriverIRQHandler();
}

WEAK void TRNG0_IRQHandler(void)
{
    TRNG0_DriverIRQHandler();
}

WEAK void WWDT0_IRQHandler(void)
{
    WWDT0_DriverIRQHandler();
}

WEAK void WWDT1_IRQHandler(void)
{
    WWDT1_DriverIRQHandler();
}

WEAK void CMC0_IRQHandler(void)
{
    CMC0_DriverIRQHandler();
}

WEAK void CTI0_IRQHandler(void)
{
    CTI0_DriverIRQHandler();
}

//*****************************************************************************

#if defined(DEBUG)
#pragma GCC pop_options
#endif // (DEBUG)
